2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_flash.c
    }
    else
    {
        /* Clears the FLASH's pending flags */
        FLASH_ClearFlag(FLASH_STS_CLRFLAG);
        /* Wait for last operation to be completed */
        status_value = FLASH_WaitForLastOpt(ProgramTimeout);
    }

    if (status_value == FLASH_EOP)
    {
        Option_Bytes_Unlock();
        FLASH->CTRL |= CTRL_Set_OPTPG;

        if ((WRP0_Data != FLASH_WRP0_MSK) || (WRP1_Data != FLASH_WRP1_MSK))
        {
            OBT->WRP1_WRP0 = (WRP1_Data | WRP0_Data);

            /* Wait for last operation to be completed */
            status_value = FLASH_WaitForLastOpt(ProgramTimeout);
        }
        else
        {
            /*No process*/
        }
                
        if (status_value != FLASH_TIMEOUT)
        {
            /* if the program operation is completed, disable the OPTPG Bit */
            FLASH->CTRL &= CTRL_Reset_OPTPG;
        }
        else
        {
            /*No process*/
        }
    }
    else
    {
        /*No process*/
    }
    /* Return the write protection operation Status */
    return status_value;
}


/**
*\*\name   FLASH_ProgramOptionBytes_RDP2
*\*\fun    Programs the Option Byte: RDP2.
*\*\param  option_byte_rpd2 :(The input parameters must be the following values)
*\*\            - FLASH_OB_RDP2_ENABLE   Enable read protection L2
*\*\            - FLASH_OB_RDP2_DISABLE  Disable read protection L2
*\*\return FLASH_STS : 
*\*\        - FLASH_BUSY     FLASH is busy
*\*\        - FLASH_ERR_PG   FLASH programming error
*\*\        - FLASH_ERR_WRP  FLASH Write protected error
*\*\        - FLASH_EOP      FLASH End of Operation
*\*\        - FLASH_ERR_RDP2 FLASH is in read protection L2 status
*\*\        - FLASH_TIMEOUT  FLASH operation timeout
**/
FLASH_STS FLASH_ProgramOptionBytes_RDP2(uint8_t option_byte_rpd2)
{
    FLASH_STS status_value = FLASH_EOP;

    /* Get the actual read protection L2 Option Byte value */
    if (FLASH_GetReadOutProtectionL2STS() != RESET)
    {
        status_value = FLASH_ERR_RDP2;
    }
    else
    {
        /*No process*/
    }
    
    if(status_value == FLASH_ERR_RDP2)
    {
    
    }
    else
    {
        Option_Bytes_Unlock();
      
        /* Clears the FLASH's pending flags */
        FLASH_ClearFlag(FLASH_STS_CLRFLAG);
        /* Wait for last operation to be completed */
        status_value = FLASH_WaitForLastOpt(ProgramTimeout);
    }

    if (status_value == FLASH_EOP)
    {
        /* Enable the Option Bytes Programming operation */
        FLASH->CTRL |= CTRL_Set_OPTPG;
        /* Restore the last read protection Option Byte value */
        OBT->RDP2 = (uint32_t)option_byte_rpd2;
        
        /* Wait for last operation to be completed */
        status_value = FLASH_WaitForLastOpt(ProgramTimeout);
        if (status_value != FLASH_TIMEOUT)
        {
            /* if the program operation is completed, disable the OPTPG Bit */
            FLASH->CTRL &= CTRL_Reset_OPTPG;
        }
        else
        {
            /*No process*/
        }
    }
    else
    {
        /*No process*/
    }

    /* Return the Option Byte program status_value */
    return status_value;
}


/**
*\*\name   FLASH_ReadOutProtectionL1
*\*\fun    Enables the read out protection.
*\*\param  Cmd:(The input parameters must be the following values)
*\*\            - ENABLE   Enable read protection L1
*\*\            - DISABLE  Disable read protection L1
*\*\return FLASH_STS : 
*\*\        - FLASH_BUSY     FLASH is busy
*\*\        - FLASH_ERR_PG   FLASH programming error
*\*\        - FLASH_ERR_WRP  FLASH Write protected error
*\*\        - FLASH_EOP      FLASH End of Operation
*\*\        - FLASH_ERR_RDP2 FLASH is in read protection L2 status
*\*\        - FLASH_TIMEOUT  FLASH operation timeout
**/
FLASH_STS FLASH_ReadOutProtectionL1(FunctionalState Cmd)
{
    uint32_t user3_nBOOT0, user3_nBOOT1, user3_nSWBOOT0, user3_BOOT0_CFG; 
    uint32_t user0_temp, user1_temp, user2_temp, user4_temp;
    uint32_t data0_temp, data1_temp;
    uint32_t WP_temp;
    FLASH_STS status_value = FLASH_EOP;

    /* Get the actual read protection L2 Option Byte value */
    if (FLASH_GetReadOutProtectionL2STS() != RESET)
    {
        status_value = FLASH_ERR_RDP2;
    }
    else
    {
        /*No process*/
    }
    
    if(FLASH_GetOptionBytes_User3(FLASH_OB_NBOOT0_SET) == SET)
    {
        user3_nBOOT0 = FLASH_OB_NBOOT0_SET;
    }
    else
    {
        user3_nBOOT0 = FLASH_OB_NBOOT0_CLR;
    }
    
    if(FLASH_GetOptionBytes_User3(FLASH_OB_NBOOT1_SET) == SET)
    {
        user3_nBOOT1 = FLASH_OB_NBOOT1_SET;
    }
    else
    {
        user3_nBOOT1 = FLASH_OB_NBOOT1_CLR;
    }
    
    if(FLASH_GetOptionBytes_User3(FLASH_OB_NSWBOOT0_SET) == SET)
    {
        user3_nSWBOOT0 = FLASH_OB_NSWBOOT0_SET;
    }    
    else
    {
        user3_nSWBOOT0 = FLASH_OB_NSWBOOT0_CLR;
    }
    
    if(FLASH_GetOptionBytes_User3(FLASH_OB_BOOT0_CFG_HIGH) == SET)
    {
        user3_BOOT0_CFG = FLASH_OB_BOOT0_CFG_HIGH;
    }
    else
    {
        user3_BOOT0_CFG = FLASH_OB_BOOT0_CFG_LOW;
    }    
        
    user0_temp = OBT->USER0;
    user1_temp = OBT->USER1;
    user2_temp = OBT->USER3_USER2 & FLASH_OB_USER2_MASK;
    user4_temp = OBT->USER4_RDP1 & FLASH_OB_USER4_MASK;
    data0_temp = OBT->Data1_Data0 & FLASH_OB_DATA0_MASK;
    data1_temp = (OBT->Data1_Data0 & (FLASH_OB_DATA1_MASK << FLASH_OB_DATA1_OFFSET)) >> FLASH_DATA0_DATA1_OFFSET;
    WP_temp = OBT->WRP1_WRP0;
    
    if(status_value == FLASH_EOP)
    {       
        FLASH_Unlock();
        status_value = FLASH_EraseOB();
    }
    else
    {
        /*No process*/
    }

    /* USER0 value write back*/
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER0(user0_temp);
    }
    else
    {
        /* no process*/
    }
    
    /* USER1 value write back*/
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER1(user1_temp);
    }
    else
    {
        /* no process*/
    }
    
    /* USER2 and USER3 value write back*/
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER3_USER2(user3_nBOOT0, user3_nBOOT1, user3_nSWBOOT0, user3_BOOT0_CFG, user2_temp);
    }
    else
    {
        /* no process*/
    }
    
  
    /* DATA0 and DATA1 value write back */
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_DATA1_DATA0((uint8_t)data1_temp, (uint8_t)data0_temp);
    }
    else
    {
        /* no process*/
    }
      
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_EnWriteProtection(~WP_temp);
    }
    else
    {
        /* no process*/
    }
    
    if(status_value == FLASH_EOP)
    {
        if (Cmd != DISABLE)
        {
            /* Enables the read out protection L1 */
            status_value = FLASH_ProgramOptionBytes_USER4_RDP1(user4_temp,FLASH_OB_RDP1_ENABLE);
        }
        else
        {
            /* Disables the read out protection L1 */
            status_value = FLASH_ProgramOptionBytes_USER4_RDP1(user4_temp,FLASH_OB_RDP1_DISABLE);
        }    
    }
    else
    {
        /* no process*/
    }
  
    /* Return the protection operation status_value */
    return status_value;
}


/**
*\*\name   FLASH_ReadOutProtectionL2_ENABLE
*\*\fun    Enables the read out protection L2.
*\*\param  none
*\*\return FLASH_STS : 
*\*\        - FLASH_BUSY     FLASH is busy
*\*\        - FLASH_ERR_PG   FLASH programming error
*\*\        - FLASH_ERR_WRP  FLASH Write protected error
*\*\        - FLASH_EOP      FLASH End of Operation
*\*\        - FLASH_ERR_RDP2 FLASH is in read protection L2 status
*\*\        - FLASH_TIMEOUT  FLASH operation timeout
**/
FLASH_STS FLASH_ReadOutProtectionL2_ENABLE(void)
{
    uint32_t user3_nBOOT0, user3_nBOOT1, user3_nSWBOOT0, user3_BOOT0_CFG; 
    uint32_t user0_temp, user1_temp, user2_temp, user4_temp, rdp1_temp;	
    uint32_t data0_temp, data1_temp;
    uint32_t WP_temp;
    FLASH_STS status_value = FLASH_EOP;

