2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_flash.c
    /* Get the actual read protection L2 Option Byte value */
    if (FLASH_GetReadOutProtectionL2STS() != RESET)
    {
        status_value = FLASH_ERR_RDP2;
    }
    else
    {
        /*No process*/
    }
    
    if(FLASH_GetOptionBytes_User3(FLASH_OB_NBOOT0_SET) == SET)
    {
        user3_nBOOT0 = FLASH_OB_NBOOT0_SET;
    }
    else
    {
        user3_nBOOT0 = FLASH_OB_NBOOT0_CLR;
    }
    
    if(FLASH_GetOptionBytes_User3(FLASH_OB_NBOOT1_SET) == SET)
    {
        user3_nBOOT1 = FLASH_OB_NBOOT1_SET;
    }
    else
    {
        user3_nBOOT1 = FLASH_OB_NBOOT1_CLR;
    }
    
    if(FLASH_GetOptionBytes_User3(FLASH_OB_NSWBOOT0_SET) == SET)
    {
        user3_nSWBOOT0 = FLASH_OB_NSWBOOT0_SET;
    }    
    else
    {
        user3_nSWBOOT0 = FLASH_OB_NSWBOOT0_CLR;
    }
    
    if(FLASH_GetOptionBytes_User3(FLASH_OB_BOOT0_CFG_HIGH) == SET)
    {
        user3_BOOT0_CFG = FLASH_OB_BOOT0_CFG_HIGH;
    }
    else
    {
        user3_BOOT0_CFG = FLASH_OB_BOOT0_CFG_LOW;
    }    
        
    user4_temp = OBT->USER4_RDP1 & FLASH_OB_USER4_MASK;
    rdp1_temp = OBT->USER4_RDP1 & FLASH_OB_RDP1_MASK;
    
    user0_temp = OBT->USER0;
    user1_temp = OBT->USER1;
    user2_temp = OBT->USER3_USER2 & FLASH_OB_USER2_MASK;
    data0_temp = OBT->Data1_Data0 & FLASH_OB_DATA0_MASK;
    data1_temp = (OBT->Data1_Data0 & (FLASH_OB_DATA1_MASK << FLASH_OB_DATA1_OFFSET)) >> FLASH_DATA0_DATA1_OFFSET;
    WP_temp = OBT->WRP1_WRP0;
    
    if(status_value == FLASH_EOP)
    {       
        FLASH_Unlock();
        status_value = FLASH_EraseOB();
    }
    else
    {
        /*No process*/
    }

    /* USER4 value and RDP1 value write back*/
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER4_RDP1(user4_temp, (uint8_t)rdp1_temp);
    }
        
    /* USER0 value write back*/
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER0(user0_temp);
    }
    else
    {
    	/* no process*/
    }
    
    /* USER1 value write back*/
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER1(user1_temp);
    }
    else
    {
    	/* no process*/
    }
	
    /* USER2 and USER3 value write back*/
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_USER3_USER2(user3_nBOOT0, user3_nBOOT1, user3_nSWBOOT0, user3_BOOT0_CFG, user2_temp);
    }
    else
    {
    	/* no process*/
    }
    
  
    /* DATA0 and DATA1 value write back */
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_DATA1_DATA0((uint8_t)data1_temp, (uint8_t)data0_temp);
    }
    else
    {
    	/* no process*/
    }
    
    
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_EnWriteProtection(~WP_temp);
    }
    else
    {
    	/* no process*/
    }
    
    if(status_value == FLASH_EOP)
    {
        status_value = FLASH_ProgramOptionBytes_RDP2(FLASH_OB_RDP2_ENABLE);
    }
    else
    {
    	/* no process*/
    }
  
    /* Return the protection operation status_value */
    return status_value;
}


/**
*\*\name   FLASH_GetOptionBytes_User0
*\*\fun    Returns the FLASH User Option Bytes values.
*\*\param  none
*\*\return FlagStatus :
*\*\            - SET      Software watchdog
*\*\            - RESET    Hardware watchdog
**/
FlagStatus FLASH_GetOptionBytes_User0(void)
{
    FlagStatus bit_status;
    if((FLASH->OB  & FLASH_OB_IWDG_SW) != (uint32_t)RESET)
    {
        bit_status = SET;
    }
    else
    {
        bit_status = RESET;
    }
    return bit_status;
}


/**
*\*\name   FLASH_GetOptionBytes_User1
*\*\fun    Returns the FLASH User Option Bytes values.
*\*\param  none
*\*\return FlagStatus :
*\*\            - SET      PF3 used as NRST
*\*\            - RESET    PF3 used as GPIO
**/
FlagStatus FLASH_GetOptionBytes_User1(void)
{
    FlagStatus bit_status;
    if((FLASH->OB & FLASH_OB_NRST_PF3) != (uint32_t)RESET)
    {
        bit_status = SET;
    }
    else
    {
        bit_status = RESET;
    }
    return bit_status;
}


/**
*\*\name   FLASH_GetOptionBytes_User2
*\*\fun    Returns the FLASH Option Bytes PORCNT values.
*\*\param  none
*\*\return PORCNT:
*\*\            - 0x00 to 0xFF.
**/
uint32_t FLASH_GetOptionBytes_User2(void)
{
    /* Return the User Option Byte2 */
    return (uint32_t)((FLASH->OB & FLASH_USER_POR_DELAY_MSK) >> FLASH_USER2_OFFSET);
}


/**
*\*\name   FLASH_GetOptionBytes_User3
*\*\fun    Returns the FLASH User Option Bytes values.
*\*\param  option_byte_bit: (The input parameters must be the following values)
*\*\            - FLASH_OB_NBOOT0_SET          nBOOT0 configuration bit
*\*\            - FLASH_OB_NBOOT1_SET          nBOOT1 configuration bit
*\*\            - FLASH_OB_NSWBOOT0_SET        nSWBOOT0 configuration bit
*\*\            - FLASH_OB_BOOT0_CFG_HIGH      BOOT0_CFG configuration bit
*\*\return FlagStatus :
*\*\            - SET      Enter this mode without resetting
*\*\            - RESET    Enter this mode reset
**/
FlagStatus FLASH_GetOptionBytes_User3(uint32_t option_byte_bit)
{
    FlagStatus bit_status;
    if(((FLASH->OB ) & (option_byte_bit >> FLASH_USER3_OFFSET)) != (uint32_t)RESET)
    {
        bit_status = SET;
    }
    else
    {
        bit_status = RESET;
    }
    return bit_status;
}


/**
*\*\name   FLASH_GetBOOTUartPIN
*\*\fun    Returns the serial communication pins for boot code.
*\*\param  none
*\*\return option_byte_user4:
*\*\         - BOOT_UARTPIN_PA9PA10    BOOT uart pins are PA9 and PA10
*\*\         - BOOT_UARTPIN_PB10PB11   BOOT uart pins are PB10 and PB11
*\*\         - BOOT_UARTPIN_PD10PD11   BOOT uart pins are PD10 and PD11
*\*\         - BOOT_UARTPIN_PA2PA3     BOOT uart pins are PA2 and PA3
**/
uint32_t FLASH_GetBOOTUartPIN(void)
{
    /* Return the User Option Byte6 */
    return (uint32_t)((FLASH->OB & FLASH_OB_BOOTSEL_MASK) >> FLASH_OB_BOOTSEL_OFFSET);
}


/**
*\*\name   FLASH_GetOptionBytes_Data0
*\*\fun    Returns the FLASH User Option Bytes values.
*\*\param  none
*\*\return data0:
*\*\            - 0x00 to 0xFF.
**/
uint32_t FLASH_GetOptionBytes_Data0(void)
{
    /* Return the User Option Byte2 */
    return (uint32_t)((FLASH->OB2 & FLASH_OB_DATA0_MASK));
}


/**
*\*\name   FLASH_GetOptionBytes_Data1
*\*\fun    Returns the FLASH User Option Bytes values.
*\*\param  none
*\*\return data1:
*\*\            - 0x00 to 0xFF.
**/
uint32_t FLASH_GetOptionBytes_Data1(void)
{
    /* Return the User Option Byte2 */
    return (uint32_t)((FLASH->OB2 & FLASH_OB_DATA1_MASK) >> FLASH_OB_DATA1_OFFSET);
}


/**
*\*\name   FLASH_GetReadOutProtectionSTS
*\*\fun    Checks whether the FLASH Read Out Protection L1 status_value is set or not.
*\*\param  none
*\*\return FlagStatus :
*\*\        - SET    Read protection L1 enable
*\*\        - RESET  Read protection L1 disable
**/
FlagStatus FLASH_GetReadOutProtectionSTS(void)
{
    FlagStatus bit_status;
    if ((FLASH->OB & FLASH_RDPRTL1_MSK) != (uint32_t)RESET)
    {
        bit_status = SET;
    }
    else
    {
        bit_status = RESET;
    }
    return bit_status;
}


/**
*\*\name   FLASH_GetReadOutProtectionL2STS
*\*\fun    Checks whether the FLASH Read Out Protection L2 status_value is set or not.
*\*\param  none
*\*\return FlagStatus :
*\*\        - SET    Read protection L2 enable
*\*\        - RESET  Read protection L2 disable
**/
FlagStatus FLASH_GetReadOutProtectionL2STS(void)
{
    FlagStatus readoutstatus;
    if ((FLASH->OB & FLASH_RDPRTL2_MSK) != (uint32_t)RESET)
    {
        readoutstatus = SET;
    }
    else
    {
        readoutstatus = RESET;
    }
    return readoutstatus;
}


/**
*\*\name   FLASH_GetWriteProtectionSTS
*\*\fun    Returns the FLASH Write Protection Option Bytes Register value.
*\*\param  none
*\*\return The FLASH Write Protection  Option Bytes Register value :
*\*\            - Bit15 - Bit0 write-protects pages (120~127) - page (0~7) 
**/
uint32_t FLASH_GetWriteProtectionSTS(void)
{
    /* Return the Flash write protection Register value */
    return (uint32_t)(FLASH->WRP);
}


/**
*\*\name   FLASH_INTConfig
*\*\fun    Enables the specified FLASH interrupts.
*\*\param  FLASH_INT :
*\*\            - FLASH_INT_ERR      FLASH Error Interrupt
*\*\            - FLASH_INT_EOP      FLASH end of operation Interrupt
*\*\param  Cmd:(The input parameters must be the following values)
*\*\            - ENABLE
*\*\            - DISABLE 
*\*\return none
**/
void FLASH_INTConfig(uint32_t FLASH_INT, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable the interrupt sources */
        FLASH->CTRL |= FLASH_INT;
    }
    else
    {
        /* Disable the interrupt sources */
        FLASH->CTRL &= ~(uint32_t)FLASH_INT;
    }
}


/**
*\*\name   FLASH_GetFlagSTS
*\*\fun    Checks whether the specified FLASH flag is set or not.
*\*\param  FLASH_FLAG :(The input parameters must be the following values)
*\*\        - FLASH_FLAG_BUSY      FLASH Busy flag
*\*\        - FLASH_FLAG_PGERR     FLASH Program error flag
*\*\        - FLASH_FLAG_WRPERR    FLASH Write protected error flag
*\*\        - FLASH_FLAG_EOP       FLASH End of Operation flag
*\*\return FlagStatus :
*\*\        - SET      Flag status is set
*\*\        - RESET    Flag status is reset
**/
FlagStatus FLASH_GetFlagSTS(uint32_t FLASH_FLAG)
{
    FlagStatus bit_status;
    if ((FLASH->STS & FLASH_FLAG) != (uint32_t)RESET)
    {
        bit_status = SET;
    }
    else
    {
        bit_status = RESET;
    }
    return bit_status;
}


/**
*\*\name   FLASH_GetOBFlagSTS
*\*\fun    Checks whether the specified FLASH flag is set or not.
*\*\param  FLASH_FLAG :(The input parameters must be the following values)
*\*\        - FLASH_FLAG_OBERR FLASH Option Byte error flag
*\*\return FlagStatus :
*\*\        - SET      Flag status is set
*\*\        - RESET    Flag status is reset
**/
FlagStatus FLASH_GetOBFlagSTS(uint32_t FLASH_FLAG)
{
    FlagStatus bit_status;
    if ((FLASH->OB & FLASH_FLAG) != (uint32_t)RESET)
    {
        bit_status = SET;
    }
    else
    {
        bit_status = RESET;
    }
    return bit_status;
}


/**
*\*\name   FLASH_ClearFlag
*\*\fun    Clears the FLASH's status flags.
*\*\param  FLASH_FLAG :(The input parameters must be the following values)
*\*\        - FLASH_FLAG_PGERR     FLASH Program error flag
*\*\        - FLASH_FLAG_WRPERR    FLASH Write protected error flag
*\*\        - FLASH_FLAG_EOP       FLASH End of Operation flag
*\*\return none
**/
void FLASH_ClearFlag(uint32_t FLASH_FLAG)
{
    /* Clear the flags */
    FLASH->STS = FLASH_FLAG;
}


/**
*\*\name   FLASH_GetSTS
*\*\fun    Returns the FLASH_STS.
*\*\param  none
*\*\return FLASH_STS :
*\*\        - FLASH_BUSY     FLASH is busy
*\*\        - FLASH_ERR_PG   FLASH programming error
*\*\        - FLASH_ERR_WRP  FLASH Write protected error
*\*\        - FLASH_EOP      FLASH End of Operation
**/
FLASH_STS FLASH_GetSTS(void)
{
    FLASH_STS flashstatus;

    if ((FLASH->STS & FLASH_FLAG_BUSY) == FLASH_FLAG_BUSY)
    {
        flashstatus = FLASH_BUSY;
    }
    else
    {
        if ((FLASH->STS & FLASH_FLAG_PGERR) != 0)
        {
            flashstatus = FLASH_ERR_PG;
        }
        else
        {
            if ((FLASH->STS & FLASH_FLAG_WRPERR) != 0)
            {
                flashstatus = FLASH_ERR_WRP;
            }
            else
            {
                flashstatus = FLASH_EOP;
            }
        }
    }

    /* Return the Flash Status */
    return flashstatus;
}


/**
*\*\name   FLASH_WaitForLastOpt
*\*\fun    Waits for a Flash operation to complete or a timeout to occur.
*\*\param  timeout :(The input parameters must be the following values)
*\*\            - EraseTimeout
*\*\            - ProgramTimeout
*\*\return FLASH_STS: The returned value can be: 
*\*\            - FLASH_BUSY     FLASH is busy
*\*\            - FLASH_ERR_PG   FLASH programming error
*\*\            - FLASH_ERR_WRP  FLASH Write protected error
*\*\            - FLASH_EOP      FLASH End of Operation
*\*\            - FLASH_TIMEOUT  FLASH operation timeout
**/
FLASH_STS FLASH_WaitForLastOpt(uint32_t Timeout)
{
    FLASH_STS status;
    uint32_t Timeout_temp;
    Timeout_temp = Timeout;
 
    /* Check for the Flash Status */
    status = FLASH_GetSTS();
    /* Wait for a Flash operation to complete or a TIMEOUT to occur */
    while ((status == FLASH_BUSY) && (Timeout_temp != 0x00))
    {
        status = FLASH_GetSTS();
        Timeout_temp--;
    }
    if (Timeout_temp == 0x00)
    {
        status = FLASH_TIMEOUT;
    }
    /* Return the operation status */
    return status;
}


/**
*\*\name   FLASH_SetVTORAddress
*\*\fun    Set interrupt vector offset address.
*\*\param  VTOR_address :(The input parameters must be the following values)
*\*\            - 0x00000000~0x7FFFFFFF
*\*\param  VTOR_cmd :(The input parameters must be the following values)
*\*\            - FLASH_VTOR_ENABLE
*\*\            - FLASH_VTOR_DISABLE
*\*\return none
**/
void FLASH_SetVTORAddress(uint32_t VTOR_address, uint32_t VTOR_cmd)
{
    /* Set VTOR address */
    FLASH->VTOR = (VTOR_cmd | VTOR_address);
}
